import React from "react";
import { Metadata } from "next";
import { IMainPageProps } from "@/interfaces/page.interface";
import { openGraphBase } from "@/app/[lang]/shared-metadata";
import { Footer } from "@/components/layout/Footer/Footer";
import { getDictionary } from "@/libs/18n/getDictionary";

import cn from "clsx";
import styles from "./page.module.css";

export async function generateMetadata({
  params,
}: Readonly<IMainPageProps>): Promise<Metadata> {
  return {
    alternates: {
      canonical: `/policy`,
    },
    openGraph: {
      ...openGraphBase,
      locale: params.lang,
    },
  };
}

export default async function Policy({
  params,
}: IMainPageProps): Promise<React.JSX.Element> {
  const { lang } = params;

  const header = (await getDictionary(lang)).header;

  return (
    <>
      <main className={cn("container", styles.main)}>
        <div className={styles.wrapper}>
          <h1>Публічний договір оферти</h1>
          <h2>1. Загальні положення</h2>
          <p>
            1.1. Цей Договір, згідно зі ст. 633 та ст. 641 Цивільного кодексу
            України, є публічною офертою Продавця, адресованою невизначеному
            колу осіб, незалежно від їхнього статусу (фізична особа, юридична
            особа, фізична особа-підприємець), укласти договір купівлі-продажу
            товару, представленого на сайті www.cbdrabbit.shop
          </p>
          <p>
            1.2. Укладаючи цей Договір, Покупець повністю приймає його умови.
          </p>
          <p>
            1.3. Згідно зі ст. 642 Цивільного кодексу України, повне і безумовне
            прийняття пропозиції укласти цей Договір (акцепт) підтверджується
            фактом оформлення Покупцем відповідного замовлення на сайті
            Інтернет-магазину.
          </p>
          <p>
            1.4. Продавець має право в односторонньому порядку змінювати умови
            цього Договору. Змінений Договір набуває чинності з моменту його
            розміщення на сайті.
          </p>
          <p className={styles.m0}>
            1.5. У цьому Договорі наведені терміни мають такі значення:
          </p>
          <ul>
            <li className={styles.li}>
              Інтернет-магазин – сайт Продавця, створений для укладення
              договорів роздрібної та оптової купівлі-продажу товару
              дистанційним способом, після ознайомлення Покупцем із
              запропонованим товаром на сайті www.cbdrabbit.shop
            </li>
            <li className={styles.li}>
              Адміністратор – Власник та адміністратор сайту www.cbdrabbit.shop
              та власник ФОП Родюк Олег Миколайович, код ЄДРПОУ 3521401759,
              фізична особа-підприємець, зареєстрована відповідно до
              законодавства України.
            </li>
            <li className={styles.li}>
              Продавець – фізична особа-підприємець Родюк Олег Миколайович
              (ідентифікаційний код РНОКПП: 3521401759), зареєстрований за
              адресою: 09100, Біла Церква, вул. Партизанська, 25, який здійснює
              продаж товару на сайті www.cbdrabbit.shop{" "}
            </li>
            <li className={styles.li}>
              Товар – продукція, запропонована до продажу на сайті https
              www.cbdrabbit.shop що є об`єктом купівлі-продажу за цим Договором.
            </li>
            <li className={styles.li}>
              Покупець – дієздатна фізична особа, яка досягла 18 років, або
              юридична особа, фізична особа-підприємець, яка здійснює замовлення
              на сайті www.cbdrabbit.shop.
            </li>
            <li className={styles.li}>
              Акцепт – повне, безумовне та беззастережне прийняття Покупцем умов
              цього Договору.
            </li>
            <li className={styles.li}>
              Замовлення – окремі позиції з асортиментного переліку товару,
              запропонованого Продавцем, обрані та зазначені Покупцем при
              оформленні замовлення на сайті www.cbdrabbit.shop.
            </li>
          </ul>

          <h2>2. Предмет Договору</h2>
          <p>
            2.1. На умовах, визначених цим Договором, Продавець
            зобов&apos;язується передати у власність Покупцю замовлений ним
            товар, а Покупець зобов&apos;язується оплатити та прийняти
            відповідний товар.
          </p>
          <p>
            2.2. Моментом укладення цього Договору (акцептом) та моментом
            повного й беззаперечного прийняття Покупцем умов Договору вважається
            момент оформлення Покупцем відповідного замовлення на сайті
            Інтернет-магазину.
          </p>
          <h2>3. Порядок оформлення замовлення</h2>
          <p>
            3.1. Покупець оформлює замовлення в Інтернет-магазині самостійно
            через форму «Кошик» або, для оптових замовлень, за допомогою
            електронної пошти чи телефону, вказаних у розділі контактів
            Інтернет-магазину.
          </p>
          <p>
            3.2. Покупець може замовити будь-який товар, представлений в
            Інтернет-магазині, який має статус «в наявності» на момент
            оформлення замовлення.
				  </p>
				  <p>3.2. Покупець може замовити будь-який товар, представлений в Інтернет-магазині, який має статус «в наявності» на момент оформлення замовлення.</p>
<p>3.3. При оформленні замовлення на сайті Інтернет-магазину, Покупець зобов’язується надати таку обов’язкову інформацію:</p>
<p>3.3.1. Прізвище, ім’я Покупця або уповноваженої особи;</p>
<p>3.3.2. Номер та адресу відділення/поштомату служби доставки ТОВ «Нова Пошта» (або іншої служби доставки, запропонованої Продавцем на сайті Інтернет-магазину в розділі «Оплата і Доставка» та у формі «Кошик»), куди буде здійснена доставка товару;</p>
<p>3.3.3. Контактний телефон та електронну адресу Покупця;</p>
<p>3.3.4. Ідентифікаційний код для юридичної особи або фізичної особи-підприємця.</p>
<p>3.4. Найменування, кількість та ціна обраного Покупцем товару вказуються в кошику на сайті Інтернет-магазину.</p>
<p>3.5. У разі відсутності товару на складі, Продавець зобов’язаний повідомити Покупця за контактним номером телефону або електронною поштою.</p>
<p>3.6. При відсутності товару, Покупець має право замінити його аналогічним товаром, відмовитися від нього або анулювати замовлення.</p>
<p>3.7. Продавець може відмовити у переданні замовлення, якщо інформація, надана Покупцем, є неповною або викликає підозру щодо її достовірності.</p>
<p>3.8. Якщо Продавцю потрібна додаткова інформація, він має право запросити її у Покупця. У разі ненадання необхідної інформації, Продавець не несе відповідальності за якість надання послуг при купівлі товару в Інтернет-магазині.</p>
<p>3.9. При оформленні замовлення через менеджера Продавця та для оптових замовлень (п. 3.1 цього Договору), Покупець зобов’язується надати інформацію, зазначену в п. 3.3-3.4 цього Договору. Для виконання оптових замовлень Продавець має право запитувати у Покупця додаткову інформацію.</p>
<p>3.10. Замовлення товару за цим Договором приймаються в робочий час Продавця, зазначений на сайті www.cbdrabbit.shop.</p>
<p>3.11. Після повного оформлення та оплати замовлення Покупцем, Продавець відправляє товар за допомогою служби доставки, обраної Покупцем серед варіантів, запропонованих на сайті Інтернет-магазину в розділі «Оплата і Доставка» та у формі «Кошик», протягом 48 годин з моменту отримання оплати.</p>
<p>3.12. Прийняття Покупцем умов цього Договору здійснюється шляхом внесення даних у реєстраційну форму на сайті Інтернет-магазину або при оформленні замовлення через менеджера Продавця. Дані про Покупця вносяться до бази даних Продавця.</p>
<p>3.13. Покупець несе відповідальність за достовірність наданої інформації при оформленні замовлення.</p>
<p>3.14. Оформлюючи замовлення, тобто акцептуючи умови цього Договору, Покупець підтверджує:</p>
<p>3.14.1. Він повністю ознайомлений і згоден з умовами цього Договору (оферти);</p>
<p>3.14.2. Він дає згоду Продавцю на збір, обробку та передачу персональних даних будь-яким способом з метою виконання умов цього Договору. Згода на обробку персональних даних діє протягом всього терміну дії Договору та необмежений час після його завершення. Покупець підтверджує, що він обізнаний про свої права, цілі збору даних, а також що його персональні дані передаються Продавцю для виконання умов Договору та проведення взаєморозрахунків. Покупець також погоджується, що Продавець має право надавати доступ та передавати персональні дані третім особам без додаткового повідомлення Покупця з метою виконання замовлення. Обсяг прав Покупця як суб’єкта персональних даних йому відомий і зрозумілий.</p>
				  <h2>4. Ціна, оплата, доставка та повернення товару</h2>
				  <p>4.1. Ціна на товар встановлюється Продавцем і вказана на сайті Інтернет-магазину. Всі ціни на товар вказані в гривнях та є актуальними на момент оформлення замовлення.</p>
<p>4.2. Продавець може змінювати ціни на товар в односторонньому порядку залежно від ринкових умов. Однак, ціна товару, яку Покупець вже оплатив, не може бути змінена.</p>
<p>4.3. Вартість товару, зазначена на сайті Інтернет-магазину, не включає в себе вартість доставки. Покупець оплачує доставку відповідно до тарифів служби доставки.</p>
<p>4.4. Загальна вартість замовлення (ціна Договору) включає вартість товару і вказується на сайті Інтернет-магазину в розділі «Кошик».</p>
<p>4.5. Покупець оплачує товар шляхом перерахування коштів на розрахунковий рахунок Продавця. Датою оплати вважається день зарахування коштів на рахунок Продавця.</p>
<p>4.6. Послуги платіжних систем, терміналів, банків, що використовуються для оплати замовлення, Покупець оплачує додатково.</p>
<p>4.7. Підтвердження про оплату замовлення надсилається на електронну адресу Покупця.</p>
<p>4.8. Оплата товару здійснюється способами, зазначеними на сайті Інтернет-магазину в розділі «Оплата і доставка».</p>
<p>4.9. Доставка замовленого та оплаченого товару здійснюється за обраною Покупцем та підтвердженою Продавцем адресою, відділенням або поштоматом служби доставки.</p>
<p>4.10. При отриманні товару, Покупець повинен перевірити відповідність товару за якісними та кількісними характеристиками у присутності представника служби доставки. Разом із товаром надаються документи згідно з законодавством України.</p>
<p>4.11. Отримавши товар, Покупець підтверджує, що не має претензій щодо кількості, зовнішнього вигляду, терміну придатності та комплектності товару.</p>
<p>4.12. Право власності та ризик випадкової втрати або пошкодження товару переходять до Покупця або його представника з моменту передачі товару службі доставки.</p>
<p>4.13. Покупець має право повернути непродовольчий товар належної якості, якщо він не задовольняє його за формою, габаритами, фасоном, кольором, розміром або з інших причин. Повернення можливе протягом 14 днів з дня купівлі, за умови, що товар не використовувався, збережено його товарний вигляд, упаковка, пломби, ярлики, а також розрахунковий документ. Перелік товарів, що не підлягають поверненню, затверджується Кабінетом Міністрів України.</p>
<p>4.14. Вартість товару повертається банківським переказом на рахунок Покупця, з якого було здійснено оплату, не пізніше 10 днів з моменту отримання товару Продавцем, за умови дотримання вимог пункту 4.13 цього Договору та чинного законодавства України.</p>
<p>4.15. Повернення товару належної якості за адресою Продавця здійснюється за рахунок Покупця та не відшкодовується Продавцем.</p>
<p>4.16. Вимоги, передбачені Законом України «Про захист прав споживачів», розглядаються Продавцем за умови надання документів, передбачених законодавством. Продавець не відповідає за недоліки товару, що виникли після його передачі Покупцеві через порушення правил користування або зберігання товару, дій третіх осіб або непереборної сили.</p>
<p>4.17. Покупець не має права відмовитися від товару належної якості, що має індивідуально-визначені властивості, якщо товар може бути використаний виключно Покупцем, який його придбав (наприклад, нестандартні розміри, характеристики, зовнішній вигляд, комплектація тощо). Підтвердженням індивідуально-визначених властивостей товару є його відмінності за розмірами та іншими характеристиками, вказаними на сайті Інтернет-магазину.</p>
				  <p>4.18. Повернення товару здійснюється за адресою, вказаною на сайті в розділі «Контакти».</p>
				  


<h2>5. Права та обов’язки сторін</h2>
<p>5.1. Продавець зобов’язаний:</p>
<p>5.1.1. Передати Покупцеві товар у відповідності до умов цього Договору та замовлення Покупця.</p>
<p>5.2. Продавець має право:</p>
<p>5.2.1. В односторонньому порядку змінювати умови цього Договору, а також ціни на товар, публікуючи їх на сайті Інтернет-магазину. Всі зміни набувають чинності з моменту їх публікації на сайті Інтернет-магазину.</p>
<p>5.2.2. В односторонньому порядку призупинити надання послуг за цим Договором у разі порушення Покупцем його умов.</p>
<p>5.3. Покупець зобов’язується:</p>
<p>5.3.1. До укладення Договору ознайомитися зі змістом Договору, його умовами та цінами, запропонованими Продавцем на сайті Інтернет-магазину.</p>
<p>5.3.2. Для виконання Продавцем своїх зобов'язань, надати всі необхідні дані, що однозначно ідентифікують його як Покупця та достатні для доставки замовленого товару.</p>
<p>5.3.3. Своєчасно та в повному обсязі оплатити вартість замовлення відповідно до умов цього Договору.</p>
<p>5.4. Покупець має право:</p>
<p>5.4.1. Оформити замовлення на товар, запропонований Продавцем на сайті Інтернет-магазину, згідно з умовами цього Договору.</p>
<p>5.4.2. Прийняти (акцептувати) пропозицію (оферту) укласти цей Договір та вимагати від Продавця його виконання.</p>
<h2>6. Відповідальність Сторін</h2>
<p>6.1. Сторони несуть відповідальність за невиконання або неналежне виконання умов цього Договору відповідно до чинного законодавства України і положень цього Договору.</p>
<p>6.2. Покупець несе відповідальність за підтримання своїх персональних даних в актуальному стані. Продавець не несе відповідальності за неналежне, несвоєчасне виконання Замовлень і своїх зобов’язань у випадку надання Покупцем недостовірної або помилкової інформації при його оформленні. Адміністратор не несе відповідальності за зміст і достовірність інформації, наданої Покупцем під час користування Сайтом.</p>
<p>6.3. Продавець не несе відповідальність за затримку виконання замовлення, якщо такі затримки відбулися з причини, що знаходяться поза сферою контролю Продавця.</p>
<p>6.4. Продавець не несе відповідальність за невідповідність зовнішнього вигляду Товару зображеного на сайті Інтернет-магазину, в разі його зміни виробником та за незначну невідповідність кольорової гами Товару, що може відрізнятися від оригіналу Товару виключно через різну колірну передачу моніторів персональних комп’ютерів окремих моделей.</p>
<p>6.5. Продавець не несе відповідальність за неналежне використання або зберігання товарів Покупцем, що були замовлені на сайті www.cbdrabbit.shop.</p>
<p>6.6. Сторони звільняються від відповідальності за повне або часткове невиконання своїх зобов'язань за цим Договором, якщо невиконання є наслідком настання надзвичайних та невідворотних обставин, що об’єктивно знаходяться поза її контролем (форс-мажорних обставин) таких як: війна або військові дії, загроза війни, збройний конфлікт або серйозна погроза такого конфлікту, включаючи, але не обмежуючись ворожими атаками, блокадами, військовим ембарго, дії іноземного ворога, загальна військова мобілізація, військові дії, оголошена та неоголошена війна, дії суспільного ворога, збурення, акти тероризму, диверсії, піратства, безлади, вторгнення, революція, заколот, повстання, масові заворушення, введення комендантської години, карантину, встановленого Кабінетом Міністрів України, дії, рішення органів державної влади, місцевого самоврядування, експропріація, примусове вилучення, захоплення підприємств, реквізиція, громадська демонстрація, страйк, аварія, протиправні дії третіх осіб, пожежа, вибух тривалі перерви в роботі транспорту, регламентовані умовами відповідних рішень та актами компетентних органів влади, закриття морських проток, ембарго, заборона (обмеження) експорту/імпорту тощо, заборонні акти Верховної Ради України, Президента України, Кабінету Міністрів України, Антимонопольного Комітету України, Національного банка України або органів місцевого самоврядування (термін «заборонні акти» розуміється як закон або документ нормативного характеру, що не дозволяють Сторонами виконати свої зобов'язання за цим договором), а також викликані винятковими погодними умовами і стихійним лихом, а саме: епідемія, сильний шторм, циклон, ураган/буревій, торнадо, повінь нагромадження снігу, ожеледь, град, заморозки, замерзання моря, проток, портів, перевалів, землетрус, блискавка, пожежа, посуха, просідання і зсув ґрунту, інші стихійні лиха, тощо за умови, що така подія впливає на належне виконання зобов’язань за цим Договором, але не існувала на час укладення цього Договору (надалі – «Форс-Мажор»). Факт настання та дії форс-мажорних обставин має бути належним чином підтверджений Торгово-Промисловою Палатою України або іншим компетентним органом відповідно до чинного законодавства України.</p>
<p>6.7.	Сторона, для якої створилася неможливість виконання зобов’язань за цим Договором внаслідок обставин Форс-Мажору та/або їх наслідків, зобов’язана повідомити іншу Сторону про настання вищевказаних обставин у письмовій формі відповідно до умов Договору негайно, та не пізніше 10 робочих днів з моменту їхнього настання довести їх існування достовірним сертифікатом  (або іншим відповідним документом, передбаченим чинним законодавством України), виданим Торгово-Промисловою Палатою України (або іншим компетентним органом відповідно до чинного законодавства України). Несвоєчасне повідомлення про Форс-Мажор позбавляє відповідну сторону права посилатися на нього у майбутньому і не звільняє від відповідальності за цим Договором.</p>
<p>6.8.	При виникненні форс-мажорних обставин строк виконання зобов’язань за цим Договором продовжується пропорційно часу, протягом якого діють такі обставини та/або їх наслідки. Після закінчення дії вказаних обставин та/або їх наслідки, Сторона, яка заявляла про їх настання, має протягом 5 (п’яти) робочих днів письмово повідомити іншу Сторону про припинення дії форс-мажорних обставин та відновлення дії договірних відносин між Сторонам. Дія Договору та зобов’язання Сторін по ньому вважаються відновленими з дня отримання другою Стороною повідомлення про припинення дії форс-мажорних обставин.</p>
<p>6.9.	Якщо Форс-мажорні обставини та/або їх наслідки продовжуються більше 30 (тридцяти) календарних днів, будь-яка Сторона в односторонньому порядку має право ініціювати припинення дії цього Договору, шляхом направлення іншій Стороні письмового повідомлення. Договір вважається припиненим з дня отримання другою Стороною такого повідомлення.</p>
<h2>7. Умови конфіденційності і захисту персональних даних</h2>
<p>7.1. Надаючи свої персональні дані на сайті Інтернет-магазину при реєстрації або оформленні замовлення, Покупець дає Адміністратору та Продавцю (далі – Розпорядники) свою добровільну згоду на обробку, використання, зберігання та передачу своїх персональних даних. Це включає внесення даних до бази даних Адміністратора, їх довічне зберігання, накопичення, оновлення та зміну за потреби. Адміністратор зобов'язується забезпечити захист даних від несанкціонованого доступу третіх осіб, не поширювати та не передавати дані будь-якій третій стороні, за винятком випадків, передбачених п. 7.3., та інших дій, передбачених законодавством про захист персональних даних, без обмеження терміну дії такої згоди.</p>
<p>7.2. Розпорядники поважають конфіденційність персональної інформації користувачів сайту та прагнуть захищати її, забезпечуючи максимально комфортні умови користування сайтом кожному користувачеві.</p>
<p>7.3. Розпорядники зобов'язуються не розголошувати отриману від Покупця інформацію. Винятком є надання Продавцем інформації контрагентам та третім особам, що діють на підставі договору з Продавцем, зокрема для виконання зобов'язань перед Покупцем, а також у випадках, коли розкриття такої інформації вимагається чинним законодавством України.</p>
<p>7.4. Розпорядники збирають лише ті персональні дані, які надані Покупцем свідомо та добровільно з метою використання сервісів сайту.</p>
<p>7.5. Розпорядники збирають та використовують персональні дані користувачів сайту для адміністрування та персоналізації сервісів сайту, забезпечення виконання замовлень Покупця за цим Договором та в інших цілях відповідно до цього Договору та чинного законодавства України.</p>
<h2>8. Інші умови</h2>
<p>8.1. Цей Договір вважається укладеним з моменту, коли особа, яка направила пропозицію укласти Договір (оферту), отримує відповідь про прийняття цієї пропозиції (акцепт) у порядку, визначеному цим Договором та чинним законодавством України.</p>
<p>8.2. Усі спори, що виникають між Сторонами, вирішуються шляхом переговорів. Якщо вирішити спірне питання шляхом переговорів не вдається, Сторони мають право звернутися до судових органів відповідно до чинного законодавства України.</p>
<p>8.3. Зміни до Договору можуть бути внесені за взаємною згодою Сторін у порядку, передбаченому чинним законодавством України.</p>
<p>8.4. У разі втрати чинності певного пункту цього Договору, всі інші пункти залишаються дійсними, а Договір продовжує діяти без урахування пункту, чинність якого втрачено.</p>
        </div>
      </main>
      <Footer lang={lang} titles={header.titles} />
    </>
  );
}
